Revit 2015 API
Application Properties
The Application type exposes the following members.
Properties
Name | Description
ActiveAddInId
Retrieves the Id of the currently running external application.
AllUsersAddinsLocation
 The folder location for .addin files for all users.
AngleTolerance
 Angle tolerance.
Assets
Cities
Returns a set of all the known city locations within Revit.
Create
Provides an object that can be used to create new instances of Autodesk Revit API objects.
CurrentRevitServerAccelerator
 Current Revit Server accelerator.
CurrentUserAddinsLocation
 The folder location for .addin files for the current user.
DefaultIFCProjectTemplate
 Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
DefaultProjectTemplate
 Full path to the default template file for new project documents.
DefaultViewDiscipline
 The view discipline that will be applied to new views by default.
Documents
 Returns a set of documents within Revit.
ExportIFCCategoryTable
 Full path to the file that defines Revit category to IFC entity mappings for IFC export.
FamilyTemplatePath
 Default path for family template files.
ImportIFCCategoryTable
 Full path to the file that defines IFC entity to Revit category mappings for IFC import.
IsArchitectureEnabled
 Checks whether or not the architecture discipline is enabled, and enable or disable it.
IsElectricalAnalysisEnabled
 Checks whether or not electrical analysis is enabled, and enable or disable it.
IsElectricalEnabled
 Checks whether or not the electrical discipline is enabled, and enable or disable it.
IsEnergyAnalysisEnabled
 Checks whether or not energy analysis is enabled, and enable or disable it.
IsMassingEnabled
 Checks whether or not the massing and site tools are enabled, and enable or disable them.
IsMechanicalAnalysisEnabled
 Checks whether or not mechanical analysis is enabled, and enable or disable it.
IsMechanicalEnabled
 Checks whether or not the mechanical discipline is enabled, and enable or disable it.
IsPipingAnalysisEnabled
 Checks whether or not piping analysis is enabled, and enable or disable it.
IsPipingEnabled
 Checks whether or not the piping discipline is enabled, and enable or disable it.
IsQuiescent
 Returns if the current application is quiescent.
IsStructuralAnalysisEnabled
 Checks whether or not the structural analysis is enabled, and enable or disable it.
IsStructureEnabled
 Checks whether or not the structure discipline is enabled, and enable or disable it.
IsSystemsEnabled
 Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Language
The language used in the current session of Revit.
MinimumThickness
 The minimum thickness allowed in Revit for a variety of geometric constructs. These include blends, extrusions, and wall layers.
ObjectFactory
Provides an object that can be used to create other instances of Autodesk Revit API objects.
Product
 The product type for the current session of Revit.
RecordingJournalFilename
 Retrieve the name of the journal file the Revit is currently recording to.
SharedParametersFilename
Contains the fully qualified path to a shared parameters file.
ShortCurveTolerance
 The enforced minimum length for any curve created by Revit.
ShowGraphicalWarningCableTrayConduitDisconnects
 Whether or not to show the graphical warnings for CTC disconnects.
ShowGraphicalWarningDuctDisconnects
 Whether or not to show the graphical warnings for duct disconnects.
ShowGraphicalWarningElectricalDisconnects
 Whether or not to show the graphical warnings for Electrical disconnects.
ShowGraphicalWarningPipeDisconnects
 Whether or not to show the graphical warnings for Pipe disconnects.
Username
 Gets the user name for the current Revit session.
VersionBuild
 Returns the internal build number of the Autodesk Revit application.
VersionName
 Returns the name of the Revit application.
VersionNumber
 Return the primary version of the Revit application.
VertexTolerance
 Vertex tolerance.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace